# Pandas

Pandas is an open - source library that is used for handle data manipulations.

for installing pandas in jupyter or colab -> !pip install pandas

for installing in vs code -> pip install pandas

Data Structure in pandas:
1. Series -> It is one-dimensional array and it shows only values not column name.
2. Dataframe -> It is multi-dimensional array and it shows values with column name.

# 1. Series

In [1]:
import pandas as pd

In [7]:
a=pd.Series([1,34,67,90])
print(a)

0     1
1    34
2    67
3    90
dtype: int64

In [9]:
print(type(a))

<class 'pandas.core.series.Series'>

# 2. DataFrame

Ques.1 -> We have to create employee data using dictionary?

In [11]:
a={
    "Emp_ID":[1,2,3,4,5,6,7,8],
    "Emp_Name":['Sam','Raj','Mohit','Sam','Gaurav','Mohit','Mohit','Garvit'],
    "Department":['IT','Sales','IT','Operations','HR','IT','Operations','HR'],
    "Working_hours":[8,9,9,9,9,8,8,8],
    "Salary":[23000,25000,35000,31000,28000,26000,30000,34000]
}

In [13]:
print(type(a))

<class 'dict'>

In [14]:
df=pd.DataFrame(a)
print(df)

   Emp_ID Emp_Name  Department  Working_hours  Salary
0       1      Sam          IT              8   23000
1       2      Raj       Sales              9   25000
2       3    Mohit          IT              9   35000
3       4      Sam  Operations              9   31000
4       5   Gaurav          HR              9   28000
5       6    Mohit          IT              8   26000
6       7    Mohit  Operations              8   30000
7       8   Garvit          HR              8   34000

How do you export our dataframe into CSV file?

In [16]:
df.to_csv("C:\\Users\\Anmol Hemani\\OneDrive\\Desktop\\Jupyter\\Test\\emp_info.csv",index=False)

How do you import our dataframe into jupyter notebook?

1. Open a folder in which you have datasets. -->
2. copy the folder location
3. Paste it into jupyter notebook
4. df=pd.read_csv("Paste_folder_location\\file_name.csv")

Method 1

In [17]:
df=pd.read_csv("C:\\Users\\Anmol Hemani\\OneDrive\\Desktop\\Jupyter\\Test\\emp_info.csv")

In [18]:
print(df)

   Emp_ID Emp_Name  Department  Working_hours  Salary
0       1      Sam          IT              8   23000
1       2      Raj       Sales              9   25000
2       3    Mohit          IT              9   35000
3       4      Sam  Operations              9   31000
4       5   Gaurav          HR              9   28000
5       6    Mohit          IT              8   26000
6       7    Mohit  Operations              8   30000
7       8   Garvit          HR              8   34000

Method 2

1. Go to home page of jupyter
2. click on upload
3. click on open --> upload
4. pd.read_csv("file_name.csv")

In [5]:
df=pd.read_csv("Test//emp_info.csv")

In [22]:
print(df)

   Emp_ID Emp_Name  Department  Working_hours  Salary
0       1      Sam          IT              8   23000
1       2      Raj       Sales              9   25000
2       3    Mohit          IT              9   35000
3       4      Sam  Operations              9   31000
4       5   Gaurav          HR              9   28000
5       6    Mohit          IT              8   26000
6       7    Mohit  Operations              8   30000
7       8   Garvit          HR              8   34000

# Task
Create Student Table Data Frame with min 5 columns and 10 rows then export it in local system then import it on google colab and run it.

In [2]:
student_data = {
    "ID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "Name": ["Aman", "Priya", "Raj", "Simran", "Vikram", "Neha", "Rohit", "Ananya", "Kunal", "Isha"],
    "Roll No": [2101, 2102, 2103, 2104, 2105, 2106, 2107, 2108, 2109, 2110],
    "Stream": ["Science", "Commerce", "Arts", "Science", "Commerce", "Arts", "Science", "Commerce", "Arts", "Science"],
    "Semester": [2, 4, 6, 3, 5, 1, 4, 2, 6, 3]
}

In [9]:
a=pd.DataFrame(student_data)
print(a)

    ID    Name  Roll No    Stream  Semester
0  101    Aman     2101   Science         2
1  102   Priya     2102  Commerce         4
2  103     Raj     2103      Arts         6
3  104  Simran     2104   Science         3
4  105  Vikram     2105  Commerce         5
5  106    Neha     2106      Arts         1
6  107   Rohit     2107   Science         4
7  108  Ananya     2108  Commerce         2
8  109   Kunal     2109      Arts         6
9  110    Isha     2110   Science         3

In [10]:
a.to_csv("C:\\Users\\Anmol Hemani\\OneDrive\\Desktop\\Jupyter\\Test\\student_info.csv",index=False)

In [11]:
a=pd.read_csv("Test//student_info.csv")
print(a)

    ID    Name  Roll No    Stream  Semester
0  101    Aman     2101   Science         2
1  102   Priya     2102  Commerce         4
2  103     Raj     2103      Arts         6
3  104  Simran     2104   Science         3
4  105  Vikram     2105  Commerce         5
5  106    Neha     2106      Arts         1
6  107   Rohit     2107   Science         4
7  108  Ananya     2108  Commerce         2
8  109   Kunal     2109      Arts         6
9  110    Isha     2110   Science         3

In [2]:
import pandas as pd

In [4]:
df=pd.read_csv("Test//covid_toy.csv")
print(df)

    age  gender  fever   cough       city has_covid
0    60    Male  103.0    Mild    Kolkata        No
1    27    Male  100.0    Mild      Delhi       Yes
2    42    Male  101.0    Mild      Delhi        No
3    31  Female   98.0    Mild    Kolkata        No
4    65  Female  101.0    Mild     Mumbai        No
..  ...     ...    ...     ...        ...       ...
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

[100 rows x 6 columns]

In [6]:
df.shape # return num of rows and columns

(100, 6)

In [7]:
df.size # return num of rows*columns

600

In [8]:
df.columns # It will return all the column name

Index(['age', 'gender', 'fever', 'cough', 'city', 'has_covid'], dtype='object')

If you want to find top data from dataframe then you can use head().

In [9]:
df.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

In [10]:
df.head(3)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No

If you want to find last data from dataframe the you can use tail().

In [11]:
df.tail()

    age  gender  fever   cough       city has_covid
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

In [12]:
df.tail(3)

    age  gender  fever   cough       city has_covid
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

If you want to find randomly indexed data then use sample().

In [13]:
df.sample()

    age gender  fever cough     city has_covid
66   51   Male  104.0  Mild  Kolkata        No

In [14]:
df.sample(3)

    age  gender  fever   cough     city has_covid
68   54  Female  104.0  Strong  Kolkata        No
15   70    Male  103.0  Strong  Kolkata       Yes
40   49  Female  102.0    Mild    Delhi        No

For specific elements

In [15]:
# loc method [row_range , column_name]

df.loc[3:5,["age","has_covid"]]

   age has_covid
3   31        No
4   65        No
5   84       Yes

In [16]:
# iloc method [row_range, column_range]

df.iloc[3:6,[0,1,3]]

   age  gender cough
3   31  Female  Mild
4   65  Female  Mild
5   84  Female  Mild

# Dataframe is mutuable

In [17]:
df.head(4)

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No

In [18]:
df["has_covid"][2]

'No'

In [19]:
df["has_covid"][2]='Yes'

C:\Users\Anmol Hemani\AppData\Local\Temp\ipykernel_5524\3874639869.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["has_covid"][2]='Yes'
C:\Users\Anmol Hemani\AppData\Local\Temp\ipykernel_5524\3874639869.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["has_covid"][2]='Yes'

In [21]:
df.head() # changes the column has_covid 2 row from no to yes

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi       Yes
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

Specific row,column --> loc,iloc

Specific column --> data --> df['column_name'][indexing]

In [22]:
df['gender'][2:5]

2      Male
3    Female
4    Female
Name: gender, dtype: object

If you wanr to check overall information then use info().

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        100 non-null    int64
 1   gender     100 non-null    object
 2   fever      90 non-null     float64
 3   cough      100 non-null    object
 4   city       100 non-null    object
 5   has_covid  100 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

If you want to check statiscally view of data then you can use describe().

In [24]:
df.describe()

              age       fever
count  100.000000   90.000000
mean    44.220000  100.844444
std     24.878931    2.054926
min      5.000000   98.000000
25%     20.000000   99.000000
50%     45.000000  101.000000
75%     66.500000  102.750000
max     84.000000  104.000000

If you want to check how many elements are available in a particular column.

In [25]:
df.head(4)

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi       Yes
3   31  Female   98.0  Mild  Kolkata        No

In [26]:
df['has_covid'].value_counts()

has_covid
No     54
Yes    46
Name: count, dtype: int64

In [27]:
df['gender'].value_counts()

gender
Female    59
Male      41
Name: count, dtype: int64

In [28]:
df['cough'].value_counts()

cough
Mild      62
Strong    38
Name: count, dtype: int64

Data --> 

1. Numerical --> Continuous data --> DOB(23 years 5 months 6 days), Salary(13567.45) etc
2. Categorical --> Discrete data --> Total_number_of_students_in_a_class, marital status etc.